run/cabin/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
26307
(
284
284
284
284
284
284
284
284
...
)
;

boundaryField
{
    cabHeatTransmissiveWall
    {
        type            chtRcTemperature;
        radiation       off;
        remoteField     T;
        K               kappaEff;
        value           uniform 284;
    }
    bayHeatTransmissiveWall
    {
        type            chtRcTemperature;
        radiation       off;
        remoteField     T;
        K               kappaEff;
        value           uniform 293;
    }
    walls
    {
        type            zeroGradient;
        K               kappaEff;
        value           uniform 293;
    }
    topExtWall
    {
        type            extendedWallHeatTransfer;

        K               kappaEff;
        radiation       off;

        Tinf            250;
        hc              2;
        alpha           50;

        radiationSources
        (
        );

        value           uniform 293;
    }
    toSolidR
    {
        type            chtRcTemperature;
        radiation       off;
        remoteField     T;
        K               kappaEff;
        value           uniform 284;
    }
    cabInlet
    {
        type            fixedValue;
        value           uniform 284;
    }
    toSolidL
    {
        type            chtRcTemperature;
        radiation       off;
        remoteField     T;
        K               kappaEff;
        value           uniform 284;
    }
    passengers
    {
        type            solidWallHeatFluxTemperature;
        gradient        uniform 0;
        q               uniform 42.6694;
        K               kappaEff;
        value           uniform 284;
    }
    bottomExtWall
    {
        type            extendedWallHeatTransfer;

        K               kappaEff;
        radiation       off;

        Tinf            250;
        hc              2;
        alpha           50;

        radiationSources
        (
        );

        value           uniform 293;
    }
    core2
    {
        type            solidWallHeatFluxTemperature;
        q               uniform 161.29;
        K               kappaEff;
        value           uniform 293;
    }
    core1
    {
        type            solidWallHeatFluxTemperature;
        q               uniform 161.29;
        K               kappaEff;
        value           uniform 293;
    }
    bayInletL
    {
        type            fixedValue;
        value           uniform 293;
    }
    bayInletR
    {
        type            fixedValue;
        value           uniform 293;
    }
    cabOutletL
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 284;
    }
    cabOutletR
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 284;
    }
    bayOutletL
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }
    bayOutletR
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
